{
    "Reset Password Notification": "Jelszóvisszaállító link",
    "You are receiving this email because we received a password reset request for your account.": "Azért kapta ezt az e-mailt, mert fiókjához tartozó jelszó-visszaállítási kérelmet kaptunk.",
    "Reset Password": "Jelszó visszaállítása",
    "This password reset link will expire in :count minutes.": "Ez a jelszóvisszaállító link :count percen belül lejár.",
    "If you did not request a password reset, no further action is required.": "Ha nem kérte a jelszó visszaállítását, nincs szükség további teendőkre.",
    "Regards": "Üdvözlettel",
    "If you're having trouble clicking the \":actionText\" button, copy and paste the URL below\ninto your web browser:": "Ha problémába ütközik az \":actionText\" gombra kattintva, másolja ki és illessze be az alábbi URL-t a böngészőjébe:",
    "All rights reserved.": "Minden jog fenntartva.",
    "Edit": "Módosítás",
    "Delete": "Törlés",
    "Save": "Mentés",
    "Cancel": "Vissza",
    "Back": "Vissza",
    "Undo": "Mégse",
    "Saved successfully": "Sikeres mentés",
    "Deleted successfully": "Sikeres törlés",
    "Restored successfully": "Sikeres visszaállítás",
    "Hello! My name is Regő Sáfrány, and I am a computer science student. My topic was a web application to assist in wedding planning, and you are currently viewing the completed website. I hope you like my project! Feel free to register as a new user or log in with the username <strong>test@weddinghelper.test</strong> and the password is <strong>password</strong>.": "Üdvözlöm! Sáfrány Regő vagyok végzős programtervező informatikus. A szakdolgozatom témája egy esküvőszervezést segítő webalkalmazás volt, és jelenleg a kész weboldalt nézi. Remélem a projektem elnyeri tetszését! Nyugodtan regisztráljon új felhasználót, vagy lépjen be a <strong>test@weddinghelper.test</strong> felhasználóval, a jelszó <strong>password</strong>.",
    "Year(s)": "Év",
    "Month(s)": "Hónap",
    "Week(s)": "Hét",
    "Day(s)": "Nap",
    "Hour(s)": "Óra",
    "Minute(s)": "Perc",
    "Second(s)": "Másodperc",
    "More": "Tovább",
    "Favorite": "Kedvelés",
    "Unfavorite": "Kedvelés eltávolítása",
    "Profile Information": "Profil információ",
    "Update your account's profile information and email address.": "Frissítse fiókja profiladatait és e-mail címét.",
    "Name": "Név",
    "Email": "Email",
    "Update Password": "Jelszó frissítése",
    "Ensure your account is using a long, random password to stay secure.": "Győződjön meg róla, hogy fiókja hosszú, véletlenszerű jelszót használ a biztonság megőrzése érdekében.",
    "Current Password": "Jelenlegi jelszó",
    "New Password": "Új jelszó",
    "Password": "Jelszó",
    "Confirm Password": "Jelszó újra",
    "Delete Account": "Fiók törlése",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please save any data or information that you wish to retain.": "A fiók törlését követően az összes erőforrás és adat véglegesen törlődik. Fiókja törlése előtt mentsen el minden olyan adatot vagy információt, amelyet meg szeretne őrizni.",
    "Are you sure you want to delete your account?": "Biztosan törölni szeretné fiókját?",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "A fiók törlését követően az összes erőforrás és adat véglegesen törlődik. Kérjük, adja meg jelszavát annak megerősítéséhez, hogy véglegesen törölni szeretné fiókját."
}